src/test/java/com/structurizr/export/d2/36141-SignIn.d2
container_20: {
  label: "API Application\n[Container: Java and Spring MVC]"
  shape: rectangle
  style: {
    fill: "#438dd5"
    stroke: "#2e6295"
    multiple: false
    font-color: "#ffffff"
    font-size: 24
  }
  container_29: {
    label: "Sign In Controller\n[Component: Spring MVC Rest Controller]"
    shape: rectangle
    style: {
      fill: "#85bbf0"
      stroke: "#5d82a8"
      multiple: false
      font-color: "#000000"
      font-size: 24
    }
  }
  container_32: {
    label: "Security Component\n[Component: Spring Bean]"
    shape: rectangle
    style: {
      fill: "#85bbf0"
      stroke: "#5d82a8"
      multiple: false
      font-color: "#000000"
      font-size: 24
    }
  }
}
container_17: {
  label: "Single-Page Application\n[Container: JavaScript and Angular]"
  shape: rectangle
  style: {
    fill: "#438dd5"
    stroke: "#2e6295"
    multiple: false
    font-color: "#ffffff"
    font-size: 24
  }
}
container_21: {
  label: "Database\n[Container: Oracle Database Schema]"
  shape: cylinder
  style: {
    fill: "#438dd5"
    stroke: "#2e6295"
    multiple: false
    font-color: "#ffffff"
    font-size: 24
  }
}

container_17 -> container_20.container_29 {
  label: "1 – Submits credentials to"
  style: {
    stroke: "#707070"
    stroke-width: 2
  }
}
container_20.container_29 -> container_20.container_32 {
  label: "2 – Validates credentials using"
  style: {
    stroke: "#707070"
    stroke-width: 2
  }
}
container_20.container_32 -> container_21 {
  label: "3 – select * from users where username = ?"
  style: {
    stroke: "#707070"
    stroke-width: 2
  }
}
container_20.container_32 <- container_21 {
  label: "4 – Returns user data to"
  style: {
    stroke: "#707070"
    stroke-width: 2
  }
}
container_20.container_29 <- container_20.container_32 {
  label: "5 – Returns true if the hashed password matches"
  style: {
    stroke: "#707070"
    stroke-width: 2
  }
}
container_17 <- container_20.container_29 {
  label: "6 – Sends back an authentication token to"
  style: {
    stroke: "#707070"
    stroke-width: 2
  }
}
